Merge two DataFrames on a single key.

In [3]:
import pandas as pd

# DataFrame 1
data1 = {
    'ID': [1, 2, 3, 4, 5],
    'Name': ['Alice', 'Bob', 'Charlie', 'David','Henry'],
    'Age': [25, 30, 35, 40 ,60]
}

df1 = pd.DataFrame(data1)
df1.head()

# DataFrame 2
data2 = {
    'ID': [1, 2, 3, 5, 6],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston','Boston'],
    'Country': ['USA', 'USA', 'USA', 'USA','USA']
}

df2 = pd.DataFrame(data2)
df2.head()

# Merging DataFrames on the key 'ID'
merged_df = df1.merge(df2, on='ID', how='inner')

print(merged_df)

   ID     Name  Age         City Country
0   1    Alice   25     New York     USA
1   2      Bob   30  Los Angeles     USA
2   3  Charlie   35      Chicago     USA
3   5    Henry   60      Houston     USA

Merge two DataFrames on multiple keys.

In [8]:
#  DataFrame 1
data1 = {
    'ID': [1, 2, 3, 4],
    'Name': ['Martin', 'Bob', 'Tao', 'joseph'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']
}

df1 = pd.DataFrame(data1)

# Sample data for DataFrame 2
data2 = {
    'ID': [1, 2, 3, 5],
    'City': ['New York', 'Los Angeles', 'San Francisco', 'Houston'],
    'Country': ['USA', 'USA', 'USA', 'USA'],
    'Income': [70000, 80000, 90000, 75000]
}

df2 = pd.DataFrame(data2)

# Merging DataFrames on the keys 'ID' and 'City'
merged_df = df1.merge(df2, on=['ID', 'City'], how='inner')

print(merged_df)

   ID    Name  Age         City Country  Income
0   1  Martin   25     New York     USA   70000
1   2     Bob   30  Los Angeles     USA   80000

Perform an outer join, inner join, left join, and right join.

In [9]:
inner_join = df1.merge(df2, on='ID', how='inner')
print("Inner Join:")
print(inner_join)

Inner Join:
   ID    Name  Age       City_x         City_y Country  Income
0   1  Martin   25     New York       New York     USA   70000
1   2     Bob   30  Los Angeles    Los Angeles     USA   80000
2   3     Tao   35      Chicago  San Francisco     USA   90000

Concatenate two DataFrames along rows.

In [10]:
# Concatenate DataFrames along rows
concatenate_df = pd.concat([df1, df2], axis=0)

print("\nConcatenate DataFrame:")
print(concatenate_df)

Concatenate DataFrame:
   ID    Name   Age           City Country   Income
0   1  Martin  25.0       New York     NaN      NaN
1   2     Bob  30.0    Los Angeles     NaN      NaN
2   3     Tao  35.0        Chicago     NaN      NaN
3   4  joseph  40.0        Houston     NaN      NaN
0   1     NaN   NaN       New York     USA  70000.0
1   2     NaN   NaN    Los Angeles     USA  80000.0
2   3     NaN   NaN  San Francisco     USA  90000.0
3   5     NaN   NaN        Houston     USA  75000.0

Concatenate two DataFrames along columns.

In [11]:
# Concatenate DataFrames along columns
concatenated_df = pd.concat([df1, df2], axis=1)

print("\nConcatenated DataFrame:")
print(concatenated_df)

Concatenated DataFrame:
   ID    Name  Age         City  ID           City Country  Income
0   1  Martin   25     New York   1       New York     USA   70000
1   2     Bob   30  Los Angeles   2    Los Angeles     USA   80000
2   3     Tao   35      Chicago   3  San Francisco     USA   90000
3   4  joseph   40      Houston   5        Houston     USA   75000

Concatenate a list of DataFrames.

In [12]:
df_list = [df1, df2]

print("DataFrame 1:")
print(df1)
print("\nDataFrame 2:")
print(df2)

DataFrame 1:
   ID    Name  Age         City
0   1  Martin   25     New York
1   2     Bob   30  Los Angeles
2   3     Tao   35      Chicago
3   4  joseph   40      Houston

DataFrame 2:
   ID           City Country  Income
0   1       New York     USA   70000
1   2    Los Angeles     USA   80000
2   3  San Francisco     USA   90000
3   5        Houston     USA   75000

In [13]:
# Concatenate list of DataFrames along rows
concatenated_df_rows = pd.concat(df_list, axis=0, ignore_index=True)

print("\nConcatenated DataFrame Along Rows:")
print(concatenated_df_rows)

Concatenated DataFrame Along Rows:
   ID    Name   Age           City Country   Income
0   1  Martin  25.0       New York     NaN      NaN
1   2     Bob  30.0    Los Angeles     NaN      NaN
2   3     Tao  35.0        Chicago     NaN      NaN
3   4  joseph  40.0        Houston     NaN      NaN
4   1     NaN   NaN       New York     USA  70000.0
5   2     NaN   NaN    Los Angeles     USA  80000.0
6   3     NaN   NaN  San Francisco     USA  90000.0
7   5     NaN   NaN        Houston     USA  75000.0

In [14]:
# Concatenate list of DataFrames along columns
concatenated_df_columns = pd.concat(df_list, axis=1, ignore_index=True)

print("\nConcatenated DataFrame Along columns:")
print(concatenated_df_columns)

Concatenated DataFrame Along columns:
   0       1   2            3  4              5    6      7
0  1  Martin  25     New York  1       New York  USA  70000
1  2     Bob  30  Los Angeles  2    Los Angeles  USA  80000
2  3     Tao  35      Chicago  3  San Francisco  USA  90000
3  4  joseph  40      Houston  5        Houston  USA  75000

Reshape data using the melt function to go from wide to long format.

In [16]:
# Reshape from wide to long format
melted_df1 = pd.melt(df1, id_vars=['ID', 'Name'], var_name='Subject', value_name='Score')

print("\nLong Format DataFrame:")
print(melted_df1)

Long Format DataFrame:
   ID    Name Subject        Score
0   1  Martin     Age           25
1   2     Bob     Age           30
2   3     Tao     Age           35
3   4  joseph     Age           40
4   1  Martin    City     New York
5   2     Bob    City  Los Angeles
6   3     Tao    City      Chicago
7   4  joseph    City      Houston

Create a pivot table to summarize data.

In [17]:
# Create pivot table to summarize data
pivot_table = pd.pivot_table(df2, values='Income', index='ID', columns='City', aggfunc='sum')

print("\nPivot Table:")
print(pivot_table)

Pivot Table:
City  Houston  Los Angeles  New York  San Francisco
ID
1         NaN          NaN   70000.0            NaN
2         NaN      80000.0       NaN            NaN
3         NaN          NaN       NaN        90000.0
5     75000.0          NaN       NaN            NaN

Group data by one or more columns and perform aggregation functions (e.g., sum, mean, count).

In [18]:
# Group data by ID and City, and perform aggregation
grouped_data = df2.groupby(['ID', 'City']).agg({
    'Income': ['sum', 'mean', 'count']
}).reset_index()

print("\nGrouped and Aggregated Data:")
print(grouped_data)

Grouped and Aggregated Data:
  ID           City Income
                       sum     mean count
0  1       New York  70000  70000.0     1
1  2    Los Angeles  80000  80000.0     1
2  3  San Francisco  90000  90000.0     1
3  5        Houston  75000  75000.0     1

Apply multiple aggregation functions to grouped data.

In [19]:
# Group data by ID and City, and apply multiple aggregation functions
grouped_data = df2.groupby(['ID', 'City']).agg({
    'Income': ['sum', 'mean', 'count']
}).reset_index()

print("\nGrouped and Aggregated Data:")
print(grouped_data)

Grouped and Aggregated Data:
  ID           City Income
                       sum     mean count
0  1       New York  70000  70000.0     1
1  2    Los Angeles  80000  80000.0     1
2  3  San Francisco  90000  90000.0     1
3  5        Houston  75000  75000.0     1

Use the groupby function to group data and apply custom functions.

In [22]:
# Custom aggregation functions
def total_income(series):
    return series.sum()

def average_income(series):
    return series.mean()

# Group data by Date and Region, and apply custom aggregation functions
grouped_data = df2.groupby(['ID', 'City']).agg({
    'Income': [total_income, average_income]
}).reset_index()

print("\nGrouped and Aggregated Data with Custom Functions:")
print(grouped_data)

Grouped and Aggregated Data with Custom Functions:
  ID           City       Income
                    total_income average_income
0  1       New York        70000        70000.0
1  2    Los Angeles        80000        80000.0
2  3  San Francisco        90000        90000.0
3  5        Houston        75000        75000.0